Revit 2024 API
Space.FloorReflectance Property
Get or set the Floor Reflectance of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double FloorReflectance { get; set; }
Visual Basic
Public Property FloorReflectance As Double
	Get
	Set
Visual C++
public:
property double FloorReflectance {
	double get ();
	void set (double value);
}
Remarks
This property is used to get or set the Floor Reflectance of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace